//*****************************************************************************
//@FileName	: zyaes256.h : the c interface of class caes
//@Version	: v1.0.0
//@Author	: zjw
//@Date		: 2015-09-08
//*****************************************************************************
#ifndef __ZYAES256_H__
#define __ZYAES256_H__
#include <string>

//*****************************************************************************
//@strText	: 需要加密的数据
//@strKey	: 加密用的密钥	
//@return  	: 返回加密之后的数据
//*****************************************************************************
std::string Encrypt(const std::string &strText, const std::string &strKey = "");

//*****************************************************************************
//@strText	: 需要解密的数据
//@strKey	: 解密用的密钥	
//@return  	: 返回解密之后的数据
//*****************************************************************************
std::string Decrypt(const std::string &strCipher, const std::string &strKey = "");
#endif // __ZYAES256_H__
